#ifndef __EXTI_INIT_H
#define __EXTI_INIT_H	
#include "sys.h"
#include "delay.h"
#include "gpio_init.h"
#include "usart_init.h"
/////////////////////////////////////////////////////////////////////////////////
//程序名：exti_init.h																												   
//函数功能：对IO口基本操作的初始化配置																					   
//																																						 
//																																						 
/////////////////////////////////////////////////////////////////////////////////

///////////////////////////////EXTI0 IO口的命名///////////////////////////////////

#define EXTI5_KEY PAin(5)   //读取EXTI0 IO的状态
#define EXTI4_KEY PAin(4)   //读取EXTI0 IO的状态
/////////////////////////////////////////////////////////////////////////////////


//函数的定义
void EXTI_init(void);								//EXTI0（外部中断0）初始化

#endif
