#ifndef __SMG_INIT_H
#define __SMG_INIT_H	

#include "sys.h"
#include "delay.h"

/////////////////////////////////////////////////////////////////////////////////
//程序名：smg_init.h																												  	 //
//函数功能：对数码管进行初始化并可以对数码管进行操作														   //
//																																						 //
//																																						 //
/////////////////////////////////////////////////////////////////////////////////


//////////////////////////////位选输出的命名//////////////////////////////////////

#define smg_a PBout(12)
#define smg_b PBout(13)
#define smg_c PBout(14)

/////////////////////////////////////////////////////////////////////////////////

//函数的定义
void GPIO_smg_Init(void);										//数码管所需IO口的初始化
void GPIO_smg_Scan(u8 wei,u8 zhi);					//某一位数的点亮
void GPIO_smgs_Scan(u32 date);							//多位同时点亮
#endif
